# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Dropbox\DEVELOPMENT\Audio visualizations\Audio spectrum analyzer zebrawood\Firmware\audioSpectrumAnalyzer\audioSpectrumAnalyzer.cydsn\audioSpectrumAnalyzer.cyprj
# Date: Wed, 22 Dec 2021 04:09:06 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {DVDAC_1_IntClock(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 21 41} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 31 61} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {DVDAC_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 79 157} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 85 171} -nominal_period 1089.7435897435896 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_debounce} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1560001 3120001} [list [get_pins {ClockBlock/dclk_glb_4}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Dropbox\DEVELOPMENT\Audio visualizations\Audio spectrum analyzer zebrawood\Firmware\audioSpectrumAnalyzer\audioSpectrumAnalyzer.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Dropbox\DEVELOPMENT\Audio visualizations\Audio spectrum analyzer zebrawood\Firmware\audioSpectrumAnalyzer\audioSpectrumAnalyzer.cydsn\audioSpectrumAnalyzer.cyprj
# Date: Wed, 22 Dec 2021 04:09:00 GMT
